
{
  "states": {
    "start": {
      "type": "info",
      "agent": "Guten Tag, hier ist der Kundenservice der Gesundheitsversicherung. Wie kann ich Ihnen helfen?",
      "customer": "Guten Tag, ich habe eine Frage zur Abdeckung von Physiotherapie. Mein Arzt hat mir 10 Behandlungen verschrieben.",
      "systemMessage": "Kunde erkundigt sich nach Physiotherapie-Leistungen. Überprüfen Sie die Versicherungsdetails.",
      "transitions": {
        "default": "get_customer_info"
      }
    },
    "get_customer_info": {
      "type": "verification",
      "agent": "Ich helfe Ihnen gerne bei Ihrer Frage zur Physiotherapie. Könnten Sie mir zunächst Ihre Versicherungsnummer mitteilen?",
      "customer": "Meine Versicherungsnummer ist GKV12345678.",
      "transitions": {
        "default": "verify_coverage"
      }
    },
    "verify_coverage": {
      "type": "action",
      "agent": "Vielen Dank. Ich überprüfe jetzt Ihre Versicherungsdetails, um zu sehen, welche physiotherapeutischen Leistungen abgedeckt sind. Einen Moment bitte.",
      "customer": "Danke, ich warte.",
      "action": "Versicherungsdetails überprüfen",
      "systemMessage": "Versicherungsdaten werden abgerufen...",
      "transitions": {
        "default": "prescription_details"
      }
    },
    "prescription_details": {
      "type": "info",
      "agent": "Vielen Dank für Ihre Geduld. Könnten Sie mir bitte mehr über die verordneten Behandlungen mitteilen? Um welche Art von Physiotherapie handelt es sich und für welche Beschwerden wurde sie verschrieben?",
      "customer": "Es geht um Krankengymnastik wegen chronischer Rückenschmerzen. Ich hatte vor einigen Monaten einen Bandscheibenvorfall.",
      "transitions": {
        "default": "explain_coverage"
      }
    },
    "explain_coverage": {
      "type": "info",
      "agent": "Nach Prüfung Ihrer Versicherungsdetails kann ich bestätigen, dass Ihr Tarif physiotherapeutische Behandlungen für Ihre Diagnose vollständig abdeckt. Bei chronischen Rückenschmerzen nach einem Bandscheibenvorfall übernehmen wir alle 10 verordneten Behandlungen.",
      "customer": "Das ist gut zu hören. Gibt es irgendwelche Einschränkungen, die ich beachten sollte?",
      "transitions": {
        "default": "coverage_details"
      }
    },
    "coverage_details": {
      "type": "decision",
      "agent": "Als gesetzlich Versicherter müssen Sie lediglich die gesetzliche Zuzahlung von 10% der Kosten plus 10€ pro Verordnung leisten. Die Behandlungen müssen innerhalb von 28 Tagen nach Ausstellung der Verordnung begonnen werden. Haben Sie bereits einen Physiotherapeuten ausgewählt?",
      "customer": "Ja, mein Arzt hat einen Physiotherapeuten in der Nähe empfohlen.",
      "suggestions": [
        "Ich kann prüfen, ob dieser Physiotherapeut direkt mit uns abrechnet.",
        "Benötigen Sie eine Genehmigung vor Beginn der Behandlungen?",
        "Möchten Sie wissen, wie die Kostenerstattung funktioniert, falls Sie in Vorleistung gehen müssen?"
      ],
      "transitions": {
        "Ich kann prüfen, ob dieser Physiotherapeut direkt mit uns abrechnet.": "check_provider",
        "Benötigen Sie eine Genehmigung vor Beginn der Behandlungen?": "approval_info",
        "Möchten Sie wissen, wie die Kostenerstattung funktioniert, falls Sie in Vorleistung gehen müssen?": "reimbursement_info",
        "default": "check_provider"
      }
    },
    "check_provider": {
      "type": "action",
      "agent": "Gerne prüfe ich, ob der Physiotherapeut einen direkten Abrechnungsvertrag mit uns hat. Wie heißt die Praxis oder der Therapeut?",
      "customer": "Die Praxis heißt 'Physio-Zentrum Gesundheit' und befindet sich in der Bergstraße 45.",
      "action": "Vertragspartner überprüfen",
      "transitions": {
        "default": "provider_confirmation"
      }
    },
    "provider_confirmation": {
      "type": "info",
      "agent": "Ich kann bestätigen, dass das 'Physio-Zentrum Gesundheit' ein Vertragspartner ist. Das bedeutet, dass die Praxis direkt mit uns abrechnet. Sie müssen nur die gesetzliche Zuzahlung dort bezahlen.",
      "customer": "Das ist praktisch. Vielen Dank für die Information.",
      "transitions": {
        "default": "additional_services"
      }
    },
    "approval_info": {
      "type": "info",
      "agent": "Bei Ihrer Diagnose und der verschriebenen Anzahl von Behandlungen benötigen Sie keine vorherige Genehmigung durch die Krankenkasse. Sie können die Therapie direkt beginnen, sobald Sie einen Termin haben.",
      "customer": "Das ist gut zu wissen. Vielen Dank.",
      "transitions": {
        "default": "additional_services"
      }
    },
    "reimbursement_info": {
      "type": "info",
      "agent": "Falls Sie bei einem Physiotherapeuten behandelt werden, der nicht direkt mit uns abrechnet, müssten Sie zunächst in Vorleistung gehen. Bewahren Sie alle Rechnungen und Quittungen auf und reichen Sie diese zusammen mit einer Kopie der ärztlichen Verordnung bei uns ein. Die Erstattung erfolgt in der Regel innerhalb von 2-3 Wochen.",
      "customer": "Verstanden. Ich hoffe aber, dass ich nicht in Vorleistung gehen muss.",
      "transitions": {
        "default": "additional_services"
      }
    },
    "additional_services": {
      "type": "decision",
      "agent": "Zusätzlich zu Ihrer Physiotherapie möchte ich Sie auf unser Rückengesundheits-Programm hinweisen. Es umfasst Online-Kurse und Präventionsmaßnahmen, die Ihnen bei der langfristigen Bewältigung Ihrer Rückenschmerzen helfen können. Möchten Sie mehr darüber erfahren?",
      "customer": "Ja, das klingt interessant. Bitte erzählen Sie mir mehr darüber.",
      "suggestions": [
        "Ich sende Ihnen Informationen zum Rückengesundheits-Programm zu.",
        "Ich erkläre Ihnen, wie Sie sich für das Programm anmelden können.",
        "Möchten Sie auch andere Gesundheitsangebote kennenlernen?"
      ],
      "transitions": {
        "Ich sende Ihnen Informationen zum Rückengesundheits-Programm zu.": "send_program_info",
        "Ich erkläre Ihnen, wie Sie sich für das Programm anmelden können.": "explain_enrollment",
        "Möchten Sie auch andere Gesundheitsangebote kennenlernen?": "other_health_services",
        "default": "send_program_info"
      }
    },
    "send_program_info": {
      "type": "action",
      "agent": "Ich sende Ihnen jetzt per E-Mail detaillierte Informationen über unser Rückengesundheits-Programm. Dort finden Sie auch einen Link zur Anmeldung. Die Teilnahme ist für Versicherte kostenlos und kann Ihre Physiotherapie sinnvoll ergänzen.",
      "customer": "Vielen Dank, ich werde mir die Informationen ansehen.",
      "action": "Programminformationen versenden",
      "transitions": {
        "default": "conclusion"
      }
    },
    "explain_enrollment": {
      "type": "info",
      "agent": "Die Anmeldung für das Programm ist einfach: Sie können sich über unsere Website oder App anmelden. Nach der Anmeldung bekommen Sie Zugang zu allen Online-Kursen und können sich auch für Präsenzkurse in Ihrer Nähe registrieren. Als Versicherter mit Rückenbeschwerden qualifizieren Sie sich automatisch für das Programm.",
      "customer": "Das klingt unkompliziert. Ich werde mich anmelden.",
      "transitions": {
        "default": "conclusion"
      }
    },
    "other_health_services": {
      "type": "info",
      "agent": "Neben dem Rückengesundheits-Programm bieten wir auch andere präventive Gesundheitsangebote an, wie Stressmanagement-Kurse, Ernährungsberatung und Fitnessprogramme. Diese können ebenfalls zur allgemeinen Verbesserung Ihrer Gesundheit beitragen und sind teilweise auch online verfügbar.",
      "customer": "Das sind hilfreiche Angebote. Ich bin besonders am Stressmanagement interessiert.",
      "transitions": {
        "default": "conclusion"
      }
    },
    "conclusion": {
      "type": "info",
      "agent": "Haben Sie noch weitere Fragen zur Abdeckung Ihrer Physiotherapie oder zu unseren Gesundheitsprogrammen?",
      "customer": "Nein, Sie haben alle meine Fragen beantwortet. Vielen Dank für Ihre Hilfe.",
      "systemMessage": "Alle Kundenanliegen wurden bearbeitet.",
      "transitions": {
        "default": "end"
      }
    },
    "end": {
      "type": "info",
      "agent": "Es freut mich, dass ich Ihnen helfen konnte. Ich wünsche Ihnen gute Besserung und viel Erfolg mit der Physiotherapie. Sollten Sie weitere Fragen haben, zögern Sie nicht, uns erneut zu kontaktieren. Einen schönen Tag noch!",
      "customer": "Vielen Dank, Ihnen auch einen schönen Tag! Auf Wiederhören.",
      "systemMessage": "Gespräch erfolgreich abgeschlossen.",
      "transitions": {}
    }
  },
  "initialState": "start"
}
