
{
  "id": "physio-therapy",
  "initial": "start",
  "states": {
    "start": {
      "meta": {
        "agentText": "Guten Tag, hier ist der Kundenservice der Gesundheitsversicherung. Wie kann ich Ihnen helfen?",
        "systemMessage": "Kunde erkundigt sich nach Physiotherapie-Leistungen. Überprüfen Sie die Versicherungsdetails."
      },
      "on": {
        "DEFAULT": "get_customer_info"
      }
    },
    "get_customer_info": {
      "meta": {
        "agentText": "Ich helfe Ihnen gerne bei Ihrer Frage zur Physiotherapie. Könnten Sie mir zunächst Ihre Versicherungsnummer mitteilen?",
        "suggestions": [
          "Zur Überprüfung der Deckung benötige ich Ihre Versicherungsnummer.",
          "Um Ihre Leistungsansprüche zu prüfen, brauche ich Ihre Versicherungsdaten.",
          "Könnten Sie mir bitte Ihre Versichertennummer nennen?"
        ]
      },
      "on": {
        "DEFAULT": "verify_coverage"
      }
    },
    "verify_coverage": {
      "meta": {
        "agentText": "Vielen Dank. Ich überprüfe jetzt Ihre Versicherungsdetails, um zu sehen, welche physiotherapeutischen Leistungen abgedeckt sind. Einen Moment bitte.",
        "action": "Versicherungsdetails überprüfen",
        "systemMessage": "Versicherungsdaten werden abgerufen..."
      },
      "on": {
        "DEFAULT": "prescription_details"
      }
    },
    "prescription_details": {
      "meta": {
        "agentText": "Vielen Dank für Ihre Geduld. Könnten Sie mir bitte mehr über die verordneten Behandlungen mitteilen? Um welche Art von Physiotherapie handelt es sich und für welche Beschwerden wurde sie verschrieben?",
        "suggestions": [
          "Können Sie mir Details zu Ihrer Diagnose und den verschriebenen Behandlungen mitteilen?",
          "Wurde Ihnen die Physiotherapie für eine akute oder chronische Erkrankung verordnet?",
          "Wie viele Behandlungen hat Ihr Arzt verordnet?"
        ]
      },
      "on": {
        "DEFAULT": "explain_coverage"
      }
    },
    "explain_coverage": {
      "meta": {
        "agentText": "Nach Prüfung Ihrer Versicherungsdetails kann ich bestätigen, dass Ihr Tarif physiotherapeutische Behandlungen für Ihre Diagnose vollständig abdeckt. Bei chronischen Rückenschmerzen nach einem Bandscheibenvorfall übernehmen wir alle 10 verordneten Behandlungen.",
        "suggestions": [
          "Laut Ihrem Versicherungspaket sind alle 10 Behandlungen vollständig abgedeckt.",
          "Die Diagnose Bandscheibenvorfall qualifiziert Sie für volle Deckung der Physiotherapie.",
          "Ihr Tarif übernimmt die Kosten für die gesamte Behandlungsserie."
        ]
      },
      "on": {
        "DEFAULT": "coverage_details"
      }
    },
    "coverage_details": {
      "meta": {
        "agentText": "Als gesetzlich Versicherter müssen Sie lediglich die gesetzliche Zuzahlung von 10% der Kosten plus 10€ pro Verordnung leisten. Die Behandlungen müssen innerhalb von 28 Tagen nach Ausstellung der Verordnung begonnen werden. Haben Sie bereits einen Physiotherapeuten ausgewählt?",
        "suggestions": [
          "Ich kann prüfen, ob dieser Physiotherapeut direkt mit uns abrechnet.",
          "Benötigen Sie eine Genehmigung vor Beginn der Behandlungen?",
          "Möchten Sie wissen, wie die Kostenerstattung funktioniert, falls Sie in Vorleistung gehen müssen?"
        ]
      },
      "on": {
        "Ich kann prüfen, ob dieser Physiotherapeut direkt mit uns abrechnet.": "check_provider",
        "Benötigen Sie eine Genehmigung vor Beginn der Behandlungen?": "approval_info",
        "Möchten Sie wissen, wie die Kostenerstattung funktioniert, falls Sie in Vorleistung gehen müssen?": "reimbursement_info",
        "DEFAULT": "check_provider"
      }
    },
    "check_provider": {
      "meta": {
        "agentText": "Gerne prüfe ich, ob der Physiotherapeut einen direkten Abrechnungsvertrag mit uns hat. Wie heißt die Praxis oder der Therapeut?",
        "action": "Vertragspartner überprüfen",
        "suggestions": [
          "Ich überprüfe, ob dieser Anbieter in unserem Netzwerk ist.",
          "Lassen Sie mich nachsehen, ob wir einen Vertrag mit diesem Therapeuten haben.",
          "Ich kann bestätigen, ob diese Praxis direkt mit uns abrechnet."
        ]
      },
      "on": {
        "DEFAULT": "provider_confirmation"
      }
    },
    "provider_confirmation": {
      "meta": {
        "agentText": "Ich kann bestätigen, dass das 'Physio-Zentrum Gesundheit' ein Vertragspartner ist. Das bedeutet, dass die Praxis direkt mit uns abrechnet. Sie müssen nur die gesetzliche Zuzahlung dort bezahlen.",
        "suggestions": [
          "Die Praxis ist in unserem Netzwerk, Sie müssen nur die Zuzahlung leisten.",
          "Der Therapeut rechnet direkt mit uns ab, Sie zahlen nur Ihren Eigenanteil.",
          "Als anerkannter Partner kann die Praxis die Kosten direkt mit uns abwickeln."
        ]
      },
      "on": {
        "DEFAULT": "additional_services"
      }
    },
    "approval_info": {
      "meta": {
        "agentText": "Bei Ihrer Diagnose und der verschriebenen Anzahl von Behandlungen benötigen Sie keine vorherige Genehmigung durch die Krankenkasse. Sie können die Therapie direkt beginnen, sobald Sie einen Termin haben.",
        "suggestions": [
          "Sie können direkt mit der Therapie beginnen ohne weitere Genehmigungen.",
          "Keine Vorabgenehmigung nötig - nehmen Sie einfach Ihre Verordnung mit zur Praxis.",
          "Bei dieser Behandlungsanzahl ist kein zusätzlicher Antrag erforderlich."
        ]
      },
      "on": {
        "DEFAULT": "additional_services"
      }
    },
    "reimbursement_info": {
      "meta": {
        "agentText": "Falls Sie bei einem Physiotherapeuten behandelt werden, der nicht direkt mit uns abrechnet, müssten Sie zunächst in Vorleistung gehen. Bewahren Sie alle Rechnungen und Quittungen auf und reichen Sie diese zusammen mit einer Kopie der ärztlichen Verordnung bei uns ein. Die Erstattung erfolgt in der Regel innerhalb von 2-3 Wochen.",
        "suggestions": [
          "Bei Vorleistung benötigen wir alle Originalbelege und die Kopie der Verordnung.",
          "Achten Sie darauf, dass auf allen Rechnungen Ihre Versichertennummer vermerkt ist.",
          "Die Erstattung können Sie bequem über unsere App oder per Post beantragen."
        ]
      },
      "on": {
        "DEFAULT": "additional_services"
      }
    },
    "additional_services": {
      "meta": {
        "agentText": "Zusätzlich zu Ihrer Physiotherapie möchte ich Sie auf unser Rückengesundheits-Programm hinweisen. Es umfasst Online-Kurse und Präventionsmaßnahmen, die Ihnen bei der langfristigen Bewältigung Ihrer Rückenschmerzen helfen können. Möchten Sie mehr darüber erfahren?",
        "suggestions": [
          "Ich sende Ihnen Informationen zum Rückengesundheits-Programm zu.",
          "Ich erkläre Ihnen, wie Sie sich für das Programm anmelden können.",
          "Möchten Sie auch andere Gesundheitsangebote kennenlernen?"
        ]
      },
      "on": {
        "Ich sende Ihnen Informationen zum Rückengesundheits-Programm zu.": "send_program_info",
        "Ich erkläre Ihnen, wie Sie sich für das Programm anmelden können.": "explain_enrollment",
        "Möchten Sie auch andere Gesundheitsangebote kennenlernen?": "other_health_services",
        "DEFAULT": "send_program_info"
      }
    },
    "send_program_info": {
      "meta": {
        "agentText": "Ich sende Ihnen jetzt per E-Mail detaillierte Informationen über unser Rückengesundheits-Programm. Dort finden Sie auch einen Link zur Anmeldung. Die Teilnahme ist für Versicherte kostenlos und kann Ihre Physiotherapie sinnvoll ergänzen.",
        "action": "Programminformationen versenden",
        "suggestions": [
          "Die Informationen werden in wenigen Minuten in Ihrem E-Mail-Postfach sein.",
          "Sie erhalten eine ausführliche Broschüre mit allen Details zum Programm.",
          "In der E-Mail finden Sie auch einen direkten Anmeldelink für das Programm."
        ]
      },
      "on": {
        "DEFAULT": "conclusion"
      }
    },
    "explain_enrollment": {
      "meta": {
        "agentText": "Die Anmeldung für das Programm ist einfach: Sie können sich über unsere Website oder App anmelden. Nach der Anmeldung bekommen Sie Zugang zu allen Online-Kursen und können sich auch für Präsenzkurse in Ihrer Nähe registrieren. Als Versicherter mit Rückenbeschwerden qualifizieren Sie sich automatisch für das Programm.",
        "suggestions": [
          "Die Online-Anmeldung dauert nur wenige Minuten und ist sofort wirksam.",
          "Sie können jederzeit zwischen Online- und Präsenzkursen wechseln.",
          "Als qualifizierter Teilnehmer entstehen Ihnen keine zusätzlichen Kosten."
        ]
      },
      "on": {
        "DEFAULT": "conclusion"
      }
    },
    "other_health_services": {
      "meta": {
        "agentText": "Neben dem Rückengesundheits-Programm bieten wir auch andere präventive Gesundheitsangebote an, wie Stressmanagement-Kurse, Ernährungsberatung und Fitnessprogramme. Diese können ebenfalls zur allgemeinen Verbesserung Ihrer Gesundheit beitragen und sind teilweise auch online verfügbar.",
        "suggestions": [
          "Unser ganzheitliches Gesundheitskonzept umfasst verschiedene Präventionsangebote.",
          "Viele unserer Programme können Sie auch mit Ihrer Familie gemeinsam nutzen.",
          "Alle Präventionsangebote sind in unserer App übersichtlich dargestellt."
        ]
      },
      "on": {
        "DEFAULT": "conclusion"
      }
    },
    "conclusion": {
      "meta": {
        "agentText": "Haben Sie noch weitere Fragen zur Abdeckung Ihrer Physiotherapie oder zu unseren Gesundheitsprogrammen?",
        "systemMessage": "Alle Kundenanliegen wurden bearbeitet.",
        "suggestions": [
          "Kann ich Ihnen noch anderweitig behilflich sein?",
          "Sind alle Ihre Fragen beantwortet worden?",
          "Benötigen Sie weitere Informationen zu einem anderen Thema?"
        ]
      },
      "on": {
        "DEFAULT": "end"
      }
    },
    "end": {
      "meta": {
        "agentText": "Es freut mich, dass ich Ihnen helfen konnte. Ich wünsche Ihnen gute Besserung und viel Erfolg mit der Physiotherapie. Sollten Sie weitere Fragen haben, zögern Sie nicht, uns erneut zu kontaktieren. Einen schönen Tag noch!",
        "systemMessage": "Gespräch erfolgreich abgeschlossen.",
        "suggestions": [
          "Vielen Dank für Ihr Vertrauen und gute Besserung!",
          "Ich wünsche Ihnen eine erfolgreiche Therapie und baldige Genesung.",
          "Bei weiteren Fragen stehen wir Ihnen jederzeit zur Verfügung."
        ]
      }
    }
  }
}
